{"weightsManifest": [{"weights": [{"shape": [100, 1], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [1], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [20000, 32], "name": "embedding_1/embeddings", "dtype": "float32"}, {"shape": [32, 400], "name": "lstm_1/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_1/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}], "modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.01, "seed": 1, "maxval": 0.01}}, "input_dim": 20000, "mask_zero": true, "dtype": "float32", "embeddings_constraint": null, "output_dim": 32, "trainable": true, "activity_regularizer": null, "embeddings_regularizer": null, "input_length": null, "batch_input_shape": [null, null], "name": "embedding_1"}}, {"class_name": "LSTM", "config": {"return_state": false, "unit_forget_bias": true, "activation": "tanh", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "unroll": false, "kernel_regularizer": null, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.2, "implementation": 1, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "go_backwards": false, "activity_regularizer": null, "units": 100, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": 1}}, "stateful": false, "name": "lstm_1"}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": 1}}}}]}, "keras_version": "2.2.2", "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss": "binary_crossentropy", "loss_weights": null, "metrics": ["acc"], "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "amsgrad": false, "epsilon": 1e-07, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033}}}}}